# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# FADE variant of YOLO26 detection model with 6-channel input and SA/DCN blocks.
# Use together with dataset yaml: channels: 6 and paired_mask: true.

nc: 80
end2end: True
reg_max: 1
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]
scale: n

backbone:
  - [-1, 1, Conv, [64, 6, 2, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 1, DCN, [128, 3, 1]] # 2
  - [-1, 2, C3k2, [256, False, 0.25]] # 3
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, MASS, [512, 2, True]] # 6 MASS on P3/8 (motion-aware selective scan)
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] # 8
  - [-1, 1, SA, [3]] # 9
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11
  - [-1, 1, SPPF, [1024, 5, 3, True]] # 12
  - [-1, 2, C2PSA, [1024]] # 13
  - [-1, 1, SA, [3]] # 14

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 9], 1, Concat, [1]] # 16
  - [-1, 2, C3k2, [512, True]] # 17
  - [-1, 1, SA, [3]] # 18

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  - [[-1, 6], 1, Concat, [1]] # 20
  - [-1, 2, C3k2, [256, True]] # 21
  - [-1, 1, SA, [3]] # 22 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 23
  - [[-1, 18], 1, Concat, [1]] # 24
  - [-1, 2, C3k2, [512, True]] # 25
  - [-1, 1, SA, [3]] # 26 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 27
  - [[-1, 14], 1, Concat, [1]] # 28
  - [-1, 1, C3k2, [1024, True, 0.5, True]] # 29
  - [-1, 1, SA, [3]] # 30 (P5/32-large)

  - [[22, 26, 30], 1, Detect, [nc]] # 31 Detect(P3, P4, P5)
